// # Fun-Fun-Functions!

// 1. Напишите функцию которая вычисляет сумму чисел от 0 до n, значение n передается как аргумент функции. Например `sumTo(3)` вычисляется ка 0 + 1 + 2 + 3.

// Решение задачи 1.

// function sumTo(n) {
//     let sum = 0;
//     for (let i = 0; i <= n; i++) {
//         sum += i;
//     }
//     return sum;
// };
// const result = sumTo(4);
// console.log(result);  

// 2. Напишите функцию `arrMaker()`, которая принимает 3 числа и выводит в консоль массив из этих трех чисел. Например: `arrMaker(1,2,3)` выводит `[1,2,3]`.

// Решение задачи 2.

// function arrMaker(numberOne, numberTwo, nunberTree) {

//     console.log([numberOne, numberTwo, nunberTree]);
// };
// arrMaker(1, 2, 3);

// 3. Напишите функцию, которая возвращает процент побед и процент поражений в морской бой или шахматы. Функция принимает два параметра: первый это количество побед, а второй это количество поражений. Функция выводит в консоль результативность в процентах. Пример работы: `myStats(352,211)`, это значит было 352 победы и 211 поражений. Функция выводит сообщение «ваш процент побед - 62%, поражений – 38%»

// Решение задачи 3.

// function stats(wins, defeat) {
//     const games = wins + defeat;
//     const winPercentage = ((wins / games) * 100).toFixed(2);
//     const defeatPercentage = ((defeat / games) * 100).toFixed(2);

    // Метод toFixed - округление числа до указанного количества знаков в дробной части на JavaScript

//     console.log(`Ваш процент побед - ${winPercentage}%, поражений – ${defeatPercentage}%`);
// }

// stats(340, 600);

// 4. `getDayOfWeek()`, которая принимает номер дня недели и выводит в консоль его название, если введен не сущетвующий день недели, то функция должна выводить "такого дня нет".
// *: продумайте функцию так, чтобы она могла выводить названия на разных языках

// Решение задачи 4 .

// function getDayOfWeek(dayNumber) {
//     const daysOfWeek = [
//         `Понедельник`,
//         `Вторник`,
//         `Среда`,
//         `Чутверг`,
//         `Пятница`,
//         `Суббота`,
//         `Воскресенье`
//     ];

//     if (dayNumber >= 0 && dayNumber < daysOfWeek.length) {
//         console.log(daysOfWeek[dayNumber]);
//     } else {
//         console.log(`Такого дня нет`);
//     }
// };
// getDayOfWeek(2);




